/*
                                                    Весы
    В стартер боксе Geek Brains есть электронные чашечные весы (вместимость каждой чашки 1 тонна) и гири массами 1г, 3г, 9г, 27г, и т.д.
    по одной штуке каждой массы. Менеджер из рекламного отдела взял такие весы и не знает,
    можно ли взвесить что-нибудь тяжелое и если можно, сколько гирь придется положить на весы (на любую чашку). Надо помочь ему.
    Формат входных данных: единственное натуральное число – масса взвешиваемого товара в граммах (не больше 1000000000).
    Формат выходных данных: единственное целое число – общее количество гирь или число –1 если данный товар взвесить невозможно.
*/

#include <stdio.h>

int main() {
    unsigned int weight;
    scanf("%u", &weight);
        
    if (weight > 1000000) {
        printf("-1\n");
        return 0;
    }
    
    int count = 0;
    
    while (weight > 0) {
        unsigned int remainder = weight % 3;
        
        if (remainder == 2) {
            count++;
            weight = weight / 3 + 1;
        } else if (remainder == 1) {
            count++;
            weight = weight / 3;
        } else {
            weight = weight / 3;
        }
    }
    
    printf("%d\n", count);
    return 0;
}